Rspots/app/controllers/locations_controller.rb

  def show
    g_id = params[:group_id]
    l_id = params[:id]
    @reviews = GroupLocation.find_by_group_id_and_location_id(g_id, l_id).reviews
---
SELECT  "group_locations".* FROM "group_locations"  WHERE "group_locations"."group_id" = 5 AND "group_locations"."location_id" = 4 LIMIT 1