Rspots/app/controllers/reviews_controller.rb

  def create
    #get id from route
    group_id = params[:id]
    location_id = require(:location).permit(:id)

    # add the location to groups_locations table
    group_location = GroupLocation.find_by_group_id_and_location_id(group_id: group_id, location_id:location_id)

    # add review that triggered location creation
    review = params.require(:review).permit(:rating, :review)
    new_review = Review.create(rating: review.rating, review: review.review, group_location_id: group_location.id, user_id: @current_user.id)
---
SELECT  "group_locations".* FROM "group_locations"  WHERE "group_locations"."group_id" = 4 AND "group_locations"."location_id" = 4 LIMIT 1
INSERT INTO "reviews" ("created_at", "group_location_id", "rating", "review", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-11-25 00:08:08.621909"], ["group_location_id", 6], ["rating", 1], ["review", "This place is awesome!"], ["updated_at", "2014-11-25 00:08:08.621909"], ["user_id", 6]]