Rspots/app/controllers/user_controller.rb

  def profile
    if @current_user
      @groups = @current_user.groups
---
SELECT "groups".* FROM "groups" INNER JOIN "group_users" ON "groups"."id" = "group_users"."group_id" WHERE "group_users"."user_id" = $1  [["user_id", 4]]